app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("name", "lastname", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Juan "], ["lastname", "David"], ["age", "25"], ["created_at", "2024-08-30 19:15:23.210672"], ["updated_at", "2024-08-30 19:15:23.210672"]]

    def set_profile
      @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]